app/Controllers/JabatanController.php

    public function index()
    {
        $data['jabatans'] = $this->modelJabatan->findAll();
---
SELECT *
FROM `jabatan`