app/Controllers/PegawaiController.php

SELECT *
FROM `jabatan`
---
    public function create()
    {
        $data['jabatan'] = $this->modelJabatan->findAll();

INSERT INTO `pegawai` (`nama_pegawai`, `alamat`, `telepon`, `jabatan_id`) VALUES ('Contoh', 'contoh', '43223', '1')
---
    public function store()
    {
        $data = [
            'nama_pegawai' => $this->request->getPost('nama_pegawai'),
            'alamat' => $this->request->getPost('alamat'),
            'telepon' => $this->request->getPost('telepon'),
            'jabatan_id' => $this->request->getPost('jabatan_id'),
        ];
        $this->modelPegawai->insert($data);

SELECT *
FROM `pegawai`
WHERE `pegawai`.`id` = '4'
SELECT *
FROM `jabatan`
---
    public function edit($id = null)
    {
        $data = [
            'pegawai' => $this->modelPegawai->find($id),
            'jabatan' => $this->modelJabatan->findAll()
        ];

UPDATE `pegawai` SET `nama_pegawai` = 'Dava', `alamat` = 'Bintaro', `telepon` = '0458734873345', `jabatan_id` = '2'
WHERE `pegawai`.`id` IN ('4')
---
    public function update($id = null)
    {
        $data = [
            'nama_pegawai' => $this->request->getPost('nama_pegawai'),
            'alamat' => $this->request->getPost('alamat'),
            'telepon' => $this->request->getPost('telepon'),
            'jabatan_id' => $this->request->getPost('jabatan_id'),
        ];
        $this->modelPegawai->update($id, $data);

DELETE FROM `pegawai`
WHERE `id` IN ('5')
---
    public function delete($id = null)
    {
        $this->modelPegawai->delete($id);