app/Models/PegawaiModel.php

public function getPegawaiWithJabatan()
    {
        return $this->select('pegawai.*, jabatan.nama_jabatan, jabatan.descripsi_jabatan')
                    ->join('jabatan', 'jabatan.id = pegawai.jabatan_id')
                    ->findAll();
---
SELECT `pegawai`.*, `jabatan`.`nama_jabatan`, `jabatan`.`descripsi_jabatan`
FROM `pegawai`
JOIN `jabatan` ON `jabatan`.`id` = `pegawai`.`jabatan_id`